<div>
    <h3> A Model Peer-to-Peer Retail Application Database </h3>
    <h3> Micah Simmerman </h3>
    <h3> CSPB 3287 Semester Project </h3>
</div>

Introduction

## Logistics

The following will load the SQL extension and connect to the `patent_citations` database using your MySQL credentials.

In [2]:
import os
import configparser
from sqlalchemy import create_engine, select
import sqlalchemy.sql

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")

database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [jasi9001]
Database: [[mysql://jasi9001...@applied-sql.cs.colorado.edu:3306/jasi9001]

In [3]:
%reload_ext sql
%matplotlib inline
%sql SELECT version()

1 rows affected.

[('8.0.27',)]

In [157]:
%%sql
drop table if exists adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [117]:
%%sql
DROP TABLE IF EXISTS user_address;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [164]:
%%sql
drop table if exists user_payment;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [173]:
%%sql
drop table if exists product_category;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [52]:
%%sql
drop table if exists product;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [53]:
%%sql
drop table if exists product_inventory;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [68]:
%%sql
drop table if exists product_discount;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [54]:
%%sql
drop table if exists user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# Introduction
<hr/>
This project is about creating flexible schemas that can handle a <strong>lot</strong> of data. In this python notebook, you will notice that each primary key declaration is an AUTO_INCREMENT integer. You will also see creation and modification timestamps included with each record. 

<b><u>The primary reason for doing things this way is:</u></b> <b>1.)</b> structure the data in a meaningful way, and <b>2.)</b> increased compatibility with alternative database schemas, including noSQL platforms like MongoDB. 

Keeping an auto-incremented primary key means that the data remains in chronologically-searchable order that is also tamper evident. Placing additional meta-data with each record makes them easy to store, transport, manipulate, and range query. The tables in this notebook are designed to support software in many different ways, ranging from basic user information storage to financial transactions involving credit card data.

# The User-Admin Management Tier
<b><hr/></b>

In [55]:
%%sql
# User table is the central table in the user-admin management section.
CREATE TABLE user (
    user_id INT PRIMARY KEY AUTO_INCREMENT,
    username VARCHAR(30) UNIQUE,
    password NVARCHAR(30),
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    email VARCHAR(300) UNIQUE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [56]:
user_data_1 = [["user_01","user_passwd_01","Joe","Murr", "user_01_@email.com"],
               ["user_02","user_passwd_02","Brice","Toven", "user_02_@email.com"],
               ["user_03","user_passwd_03","Jen","Jackson", "user_03_@email.com"],
               ["user_04","user_passwd_04","Tammy","Smith", "user_04_@email.com"],
               ["user_05","user_passwd_05","Melanie ","Baldwin", "user_05_@email.com"],
               ["admin_06","admin_passwd_06","Rene ","Pratt", "admin_06_@email.com"],
               ["admin_07","admin_passwd_07","Malik ","Coleman", "admin_07_@email.com"],
               ["admin_08","admin_passwd_08","Sheldon ","Wolf", "admin_08_@email.com"],
               ["admin_09","admin_passwd_09","Ramiro","Blackwell", "admin_09_@email.com"],
               ["admin_10","admin_passwd_10","Suzy","Q", "admin_10_@email.com"],  # Ramiro made two accounts
               # The next two inserts should fail due to UNIQUE unsername and email constraints, respectively.
               # ["user_01","test_password_01","Duplicate","Username", "un_test_email@email.com"],
               # ["poser_08","test_password_08","Duplicate","Email", "user_01_@email.com"]
              ]

In [57]:
insert_users = """
INSERT INTO 
    user (username, password, first_name, last_name, email)
VALUES
    ("%s","%s","%s","%s", "%s");
"""
count = 1
for user in user_data_1:
    try:
        res = con.execute(insert_users, user[0], user[1], user[2], user[3], user[4])
        print("Insert:", user[2], user[3], "insert was successful.")
    except:
        print("Insert:", user[2], user[3], " insert FAILED.")
    count+=1

Insert: Joe Murr insert was successful.
Insert: Brice Toven insert was successful.
Insert: Jen Jackson insert was successful.
Insert: Tammy Smith insert was successful.
Insert: Melanie  Baldwin insert was successful.
Insert: Rene  Pratt insert was successful.
Insert: Malik  Coleman insert was successful.
Insert: Sheldon  Wolf insert was successful.
Insert: Ramiro Blackwell insert was successful.
Insert: Suzy Q insert was successful.
Insert: Duplicate Username  insert FAILED.
Insert: Duplicate Email  insert FAILED.

In [92]:
%%sql
SELECT * FROM user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(1, "'user_01'", "'user_passwd_01'", "'Joe'", "'Murr'", "'user_01_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (2, "'user_02'", "'user_passwd_02'", "'Brice'", "'Toven'", "'user_02_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 54)),
 (4, "'user_04'", "'user_passwd_04'", "'Tammy'", "'Smith'", "'user_04_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (5, "'user_05'", "'user_passwd_05'", "'Melanie '", "'Baldwin'", "'user_05_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (6, "'admin_06'", "'admin_passwd_06'", "'Rene '", "'Pratt'", "'admin_06_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (7, "'admin_07'", "'admin_passwd_07'", "'Malik '", "'Coleman'", "'admin_07_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (8, "'admin_08'", "'admin_passwd_08'", "'Sheldon '", "'Wolf'", "'admin_08_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (9, "'admin_09'", "'admin_passwd_09'", "'Ramiro'", "'Blackwell'", "'admin_09_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (10, "'admin_10'", "'admin_passwd_10'", "'Suzy'", "'Q'", "'admin_10_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47))]

### Test the 'modified_at' on-update timestamp trigger.
<p>Now we make sure that the on-update trigger was placed on <b>user.modified_at</b> by changing the email of user 3, Brice Toven.</p>

In [59]:
%%sql
# Change Brice Toven's email to make sure the update trigger is working properly.
UPDATE user
SET
    email = 'brice_toven_07@gmail.com'  # CHANGE A VALUE TO TEST THE UPDATE TRIGGER
WHERE
    user_id = 3;
    
SELECT * FROM user WHERE user_id = 3;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 54))]

# The adminuser table
<hr/>

### Rene Pratt, Malik Coleman, Sheldon Wolf, and Ramiro Blackwell have different roles in the P2P Ecommmerce system. 

    -Rene is a Business Admin for company X, a company that sells items through the platform. She needs access to create and modify her company's new product listings.
    -Malik is a requisitioner for Company X, where he manages inventory.
    -Sheldon works in the IT department of the P2P company, Sheldon has been on a real roll lately.
    -Ramiro works in one of the shipping warehouses, he needs access to check on the status of existing orders.

### The "admin_type" attribute determines the adminuser's data access permissions.

Sheldon has been doing well, he just received a promotion that gives him a higher security clearance. In the example below, we will look Sheldon up by his user ID number and update his permission by changing his admin_type.

In [158]:
%%sql
CREATE TABLE adminuser (
    admin_id INT PRIMARY KEY AUTO_INCREMENT,  # foreign key, references 'user.user_id'
    user_id INT,
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    admin_type VARCHAR(30),  # BusinessAdmin / Requisitioner / IT / Warehouse
    permissions VARCHAR(30),  # '01_admin' / '02_purchaser' / '03_IT' / '04_warehouse'
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    
    UNIQUE KEY(user_id, first_name),  # duplicate admin records are a no-no.
    CONSTRAINT ADMINUSER_isA_USER FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

A table like adminuser could be used to monitor, update, and control user access privileges.

In [159]:
admins = [[6, "Rene ","Pratt", 'BusinessAdmin', '01_admin'],
          [7, "Malik ","Coleman", 'Requisitioner', '02_purchaser'],
          [8,  'IT', "Sheldon ", "Wolf", '03_IT'],
          [9, "Ramiro","Blackwell", 'Warehouse', '04_warehouse'],
          [10, "Suzy","Q", 'Warehouse', '04_warehouse']]

In [161]:
insert_admins = """
INSERT INTO 
    adminuser (user_id, first_name, last_name, admin_type, permissions)
VALUES
    ("%s","%s","%s","%s","%s");
"""

for admin in admins:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_admins, admin[0], admin[1], admin[2], admin[3], admin[4])
        print("Insert for admin:", admin[1], admin[2], "was successful.")
    except:
        print("Insert for admin:", admin[1], admin[2], "has FAILED.")

Insert for admin: Rene  Pratt has FAILED.
Insert for admin: Malik  Coleman has FAILED.
Insert for admin: IT Sheldon  has FAILED.
Insert for admin: Ramiro Blackwell has FAILED.
Insert for admin: Suzy Q has FAILED.

### Let's upgrade Sheldon's permissions using his employee ID number.

In [162]:
%%sql
UPDATE adminuser
SET
    permissions = '04_IT'
WHERE
    user_id = 8;

SELECT * FROM adminuser WHERE user_id = '8';

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(3, 8, "'IT'", "'Sheldon '", "'Wolf'", '04_IT', datetime.datetime(2023, 4, 30, 6, 20, 27), datetime.datetime(2023, 4, 30, 6, 20, 42))]

<b>Congratulations, Sheldon!</b>

In [163]:
%%sql
select * from adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
5 rows affected.

[(1, 6, "'Rene '", "'Pratt'", "'BusinessAdmin'", "'01_admin'", datetime.datetime(2023, 4, 30, 6, 20, 27), datetime.datetime(2023, 4, 30, 6, 20, 27)),
 (2, 7, "'Malik '", "'Coleman'", "'Requisitioner'", "'02_purchaser'", datetime.datetime(2023, 4, 30, 6, 20, 27), datetime.datetime(2023, 4, 30, 6, 20, 27)),
 (3, 8, "'IT'", "'Sheldon '", "'Wolf'", '04_IT', datetime.datetime(2023, 4, 30, 6, 20, 27), datetime.datetime(2023, 4, 30, 6, 20, 42)),
 (4, 9, "'Ramiro'", "'Blackwell'", "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 4, 30, 6, 20, 27), datetime.datetime(2023, 4, 30, 6, 20, 27)),
 (5, 10, "'Suzy'", "'Q'", "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 4, 30, 6, 20, 27), datetime.datetime(2023, 4, 30, 6, 20, 27))]

<strong>It will come in handy later to place an index on the user_id column of each table in the User-Admin Management Tier. This way we can retreive records rapidly when a user e.g., makes a purchase.</strong>

In [129]:
%%sql
# Creating well-chosen secondary indexes such as this one can dramatically increase record look-up speeds.
# You can imagine a theoretical "web" of connected user data originating from multiple tables in the UA Management
# Tier. Retrieving data from these secondary indexes should only require less than 5 random disk I/O's to complete.
CREATE INDEX USER_ADMIN_INDEX  
ON adminuser (admin_id);

# The user_address table
<hr/>

Address information in this table forms a well-normalized, data intensive schema that makes sense to store in a separate table. Notice that the user's name is not mentioned in any of these records. This enhances the level of privacy in the data. Each address can easily be associated with its' owner by looking up the <strong>user_id</strong> foreign key in the user table. 

The UNIQUE KEY constraint, ensures that duplicate addressess are not entered by the user. The final constraint ensures that if any record gets deleted from the user table, corresponding records will be deleted here as well.

In [118]:
%%sql
# 
CREATE TABLE user_address (
    address_id INT PRIMARY KEY AUTO_INCREMENT,  #
    user_id INT,  #  user_address.user_id refers to user.user_id
    is_primary_residence BOOLEAN DEFAULT false,  # 
    address_line1 VARCHAR(100) NOT NULL,  # e.g., 1312 Cherry Basket ln.
    address_line2 VARCHAR(100),  # e.g., Unit 2
    city VARCHAR(40) NOT NULL,  # e.g., Midland
    state VARCHAR(15) NOT NULL,  # e.g., Texas
    postal_code VARCHAR(15) NOT NULL, # e.g., 79701
    country VARCHAR(56),  # e.g., United States
    phone_number VARCHAR(15) NOT NULL, # e.g., (702)579-0585
    
    UNIQUE KEY(user_id, address_line1),
    CONSTRAINT USER_ADDRESS_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [119]:
user_addresses = [[1, True, "8447C Airport Street", "Apt#2", "Klamath Falls","OR", "97603", "United States", "(102)479-4505"],
                  [1, False, "255 W. Some Other Rd.", "N/A", "Tampa","FL", "33769", "United States", "(402)455-4599"],
                  [2, True, "328 Saxton St.", "N/A", "Englewood","NJ", "07631", "United States", "(202)484-0535"],
                  [3, True, "8539 W. Olive Court", "N/A", "Bemidji","MN", "56601", "United States", "(502)474-7505"],
                  [3, True, "8546 Laurel Ave.","N/A","Avon Lake", "OH", "44012", "United States", "(102)479-4505"],
                  [4, True, "467 Cooper St.", "N/A", "Ottumwa","IA", "52501", "United States", "(702)579-0585"],
                  [5, True, "9154 Main Court", "N/A", "Latrobe","PA", "15650", "United States", "(702)579-0585"],
                  [5, False, "12 Marshall Street", "N/A", "Galena","MD", "21635", "United States", "(702)579-0585"],
                  [5, False, "2849 Peck Street", "N/A", "Manchester","NH", "03101", "United States", "(702)579-0585"],
                  [6, True, "7019 E. Border Street", "N/A", "Strongsville","Strongsville", "OH", "United States", "(702)579-0585"],
                  [7, True, "819 Aspen Ave.", "N/A", "Maplewood","NJ", "07040", "United States", "(702)579-0585"],
                  [8, True, "admin_08","9216 W. Greenview Ave.", "N/A", "Williamstown","NJ", "08094", "United States", "(502)479-4505"],
                  [9, True, "426 N. Bay Meadows Rd.", "N/A", "Largo","FL", "33771", "United States", "(402)455-4599"],                
                  # This last insert SHOULD fail since that user_id does not exist within user table.
                  # [11,True, "8320 W. Brookside Street","N/A","Streamwood", "IL", "60107", "United States", "(102)479-4505"],
                 ]

In [120]:
insert_user_address = """
INSERT INTO 
    user_address (user_id, is_primary_residence, address_line1, address_line2, city, state, postal_code, country, phone_number)
VALUES
    ("%s","%s","%s","%s","%s","%s","%s","%s","%s");
"""

for user in user_addresses:
    # res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7], user[8])
    try:
        res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7], user[8])
        print("user_id:", user[0], "'s address was inserted successfully.")
    except:
        print("user_id:", user[0], "'s address insertion FAILED.")

user_id: 1 's address was inserted successfully.
user_id: 1 's address was inserted successfully.
user_id: 2 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 4 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 6 's address was inserted successfully.
user_id: 7 's address was inserted successfully.
user_id: 8 's address was inserted successfully.
user_id: 9 's address was inserted successfully.
user_id: 11 's address insertion FAILED.

We can use this table to perform address lookups and queries

In [144]:
%%sql

WITH count_address AS (
SELECT user_id, COUNT(user_id) AS 'num_homes'
FROM user_address
GROUP BY user_id
)

SELECT user.user_id AS 'user ID', user.first_name, user.last_name, count_address.num_homes AS 'Number of residences'
FROM user
JOIN count_address
WHERE user.user_id = count_address.user_id and count_address.num_homes >= 2;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
3 rows affected.

[(1, "'Joe'", "'Murr'", 2),
 (3, "'Jen'", "'Jackson'", 2),
 (5, "'Melanie '", "'Baldwin'", 3)]

In [123]:
%%sql
# this will come in handy later.
CREATE INDEX USER_RESIDENCE_INDEX  
ON user_address (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

## The user_payment table
<hr/>

In [165]:
%%sql
CREATE TABLE user_payment (
    payment_id INT PRIMARY KEY AUTO_INCREMENT,  # good to keep track of payment options.
    user_id INT NOT NULL,  # Foreign key that references user.user_id
    payment_type VARCHAR(40) NOT NULL,  # e.g.,          'DEBIT'            ...     'CREDIT'
    provider VARCHAR(100) NOT NULL,  # e.g., '(WELLS FARGO' | 'CHASE'| ...) ... ('VISA' | 'DISCOVERY' | ...) 
    card_number VARCHAR(20) NOT NULL,
    cvc VARCHAR(10) NOT NULL,  # always 3 numbers
    expiry VARCHAR(10),  # e.g., '2025-07' (cards typically expire the first day of the month.)
    
    UNIQUE KEY(user_id, card_number),
    # CONSTRAINT PAYMENT_TYPE_NO_DUPS UNIQUE(user_id, provider, card_number),  # users can have only one instance of each E-transfer provider, and one instance of each card.
    CONSTRAINT USER_PAYMENT_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [166]:
%%sql
# Because this is what conects user_address to the user table, we want to place an index on user_address.user_id.
CREATE INDEX USER_PAYMENT_INDEX  
ON user_payment (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

<strong>We don't want any duplicate credit cards on file. So we can place a non-clustered index on (user_id, card_number) to make sure that this can't happen. Then we insert some test data, including a couple instances of records that we DON'T want to insert into the table.</strong>

In [167]:
user_payment_methods = [[1, "DEBIT", "CHASE", "4485202750970764", "505", "05/2024"],
                        [1, "CREDIT", "VISA", "4485858039365496", "391", "9/2023"], # user can have multiple cards
                        [2, "DEBIT", "VISA", "4539447657840026", "924", "07/2025"], 
                        [2, "CREDIT", "VISA", "4716013835369778", "804", "12/2024"], # 
                        [3, "CREDIT", "VISA", "4556994540374919", "536", "03/2022"],
                        [4, "DEBIT", "VISA", "4929053913134176", "958", "11/2023"],
                        [5, "CREDIT", "DISCOVERY", "4485596057592985", "713", "08/2029"],
                        [6, "CREDIT", "VISA", "4539628822621173", "121", "01/2028"],
                        [7, "CREDIT", "DISCOVERY", "4842467639356646", "548", "02/2026"],
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"],
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],
                        # The user_payment table does not allow duplicate payment information to be entered into the table. 
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],  # FAIL -- duplicate card number
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"]]  # FAIL -- duplicate card number

In [168]:
insert_user_payment = """
INSERT INTO 
    user_payment (user_id, payment_type, provider, card_number, cvc, expiry)
VALUES
    ("%s","%s","%s","%s","%s", "%s");
"""

for payment in user_payment_methods:
    try:
        res = con.execute(insert_user_payment, payment[0], payment[1], payment[2], payment[3], payment[4], payment[5])
        print("SUCCESS! user_id", payment[0], "'s payment info was inserted into 'user_payment'.")
    except:
        print("FAILED. could not insert user_id", payment[0], "'s payment information.")

SUCCESS! user_id 1 's payment info was inserted into 'user_payment'
SUCCESS! user_id 1 's payment info was inserted into 'user_payment'
SUCCESS! user_id 2 's payment info was inserted into 'user_payment'
SUCCESS! user_id 2 's payment info was inserted into 'user_payment'
SUCCESS! user_id 3 's payment info was inserted into 'user_payment'
SUCCESS! user_id 4 's payment info was inserted into 'user_payment'
SUCCESS! user_id 5 's payment info was inserted into 'user_payment'
SUCCESS! user_id 6 's payment info was inserted into 'user_payment'
SUCCESS! user_id 7 's payment info was inserted into 'user_payment'
SUCCESS! user_id 8 's payment info was inserted into 'user_payment'
SUCCESS! user_id 9 's payment info was inserted into 'user_payment'
FAILED. could not insert user_id 9 's payment information
FAILED. could not insert user_id 8 's payment information

In [537]:
%%sql
select * from user_payment
order by user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
11 rows affected.

[(1, 1, "'DEBIT'", "'CHASE'", "'4485202750970764'", "'505'", "'05/2024'"),
 (2, 1, "'CREDIT'", "'VISA'", "'4485858039365496'", "'391'", "'9/2023'"),
 (3, 2, "'DEBIT'", "'VISA'", "'4539447657840026'", "'924'", "'07/2025'"),
 (4, 2, "'CREDIT'", "'VISA'", "'4716013835369778'", "'804'", "'12/2024'"),
 (5, 3, "'CREDIT'", "'VISA'", "'4556994540374919'", "'536'", "'03/2022'"),
 (6, 4, "'DEBIT'", "'VISA'", "'4929053913134176'", "'958'", "'11/2023'"),
 (7, 5, "'CREDIT'", "'DISCOVERY'", "'4485596057592985'", "'713'", "'08/2029'"),
 (8, 6, "'CREDIT'", "'VISA'", "'4539628822621173'", "'121'", "'01/2028'"),
 (9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'"),
 (10, 8, "'DEBIT'", "'DISCOVERY'", "'4485944095819335'", "'788'", "'07/2024'"),
 (11, 9, "'CREDIT'", "'VISA'", "'4532191431974902'", "'267'", "'10/2025'")]

<strong>A credit card company is offering a special promotion to certain company employees.</strong>
<strong>GOAL: Find the first_name, last_name, email, and admin_type (AKA Title) of current employees with a DISCOVERY credit card on file.</strong>

In [156]:
%%sql
# Use Common Table Expressions.
WITH admin_users AS (
    SELECT 
        adminuser.user_id AS 'user_id', user.first_name AS 'first_name', user.last_name AS 'last_name', adminuser.admin_type AS 'admin_type', 
            user.email AS 'email' 
    FROM 
        adminuser
    INNER JOIN
        user
    ON
        adminuser.user_id = user.user_id
)


SELECT * FROM admin_users;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(6, "'Rene '", "'Pratt'", "'BusinessAdmin'", "'admin_06_@email.com'"),
 (7, "'Malik '", "'Coleman'", "'Requisitioner'", "'admin_07_@email.com'"),
 (8, "'Sheldon '", "'Wolf'", "'Wolf'", "'admin_08_@email.com'"),
 (9, "'Ramiro'", "'Blackwell'", "'Warehouse'", "'admin_09_@email.com'"),
 (10, "'Suzy'", "'Q'", "'Warehouse'", "'admin_10_@email.com'"),
 (6, "'Rene '", "'Pratt'", "'BusinessAdmin'", "'admin_06_@email.com'"),
 (7, "'Malik '", "'Coleman'", "'Requisitioner'", "'admin_07_@email.com'"),
 (8, "'Sheldon '", "'Wolf'", "'Wolf'", "'admin_08_@email.com'"),
 (9, "'Ramiro'", "'Blackwell'", "'Warehouse'", "'admin_09_@email.com'"),
 (10, "'Suzy'", "'Q'", "'Warehouse'", "'admin_10_@email.com'")]

# The Product Management Tier
<hr/>

The 'product' table has a one-to-one relationship with 'product_inventory'. The relationship between the 'product' and 'product_category' tables is 1-1(0) or optional. The same goes for the 'product' and 'product_discount' tables.

## The 'product_category' table
<hr/>

In [174]:
%%sql
CREATE TABLE product_category (
    category_id INT PRIMARY KEY AUTO_INCREMENT,  # This PK is referenced by product.category_id
    category_name VARCHAR(50) UNIQUE NOT NULL,  # 
    category_desc VARCHAR(400),  #
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,  # 
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(category_name, category_desc)  # no duplicate categories.
);  
# Products belong to a product category, but the category can change, and even be NULL (product still exists if category is deleted).

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [175]:
# category_id is NOT auto-increment. Product categories is in many ways, already an index.
product_categories = [["outdoor_gear", "Camping, Fishing, and Hiking gear."],
                      ["mens_clothing", "The latest fashions in menswear."],
                      ["mens_shoes", "Find a great fit."],
                      ["womens_clothing", "Seasonal fashions, clearance prices."],
                      ["womens_shoes", "We know shoes."],
                      ["garden_supplies", "Lawn, garden, and landscaping supplies."],
                      ["sports_equipment", "Soccer, footbal, basketball, baseball and more."],
                      ["electronics", "Top tech gadgets."],
                      ["grocery", "Fresh produce, dairy, Deli and more."],
                      ["automotive", "Oil, tire, and car care products."]
                     ]

### Run the following cell twice to see how product_category table prevents duplicate entries.

In [177]:
insert_product_categories = """
INSERT INTO 
    product_category (category_name, category_desc)
VALUES
    ("%s","%s");
"""

for category in product_categories:
    try:
        res = con.execute(insert_product_categories, category[0], category[1])
        print("SUCCESS! category_id", category[0], "was inserted into 'product_category'")
    except:
        print("FAILED. Could not insert category_id", category[0], "into 'product_category'")

FAILED. Could not insert category_id outdoor_gear into 'product_category'
FAILED. Could not insert category_id mens_clothing into 'product_category'
FAILED. Could not insert category_id mens_shoes into 'product_category'
FAILED. Could not insert category_id womens_clothing into 'product_category'
FAILED. Could not insert category_id womens_shoes into 'product_category'
FAILED. Could not insert category_id garden_supplies into 'product_category'
FAILED. Could not insert category_id sports_equipment into 'product_category'
FAILED. Could not insert category_id electronics into 'product_category'
FAILED. Could not insert category_id grocery into 'product_category'
FAILED. Could not insert category_id automotive into 'product_category'

## The 'product' table
<hr/>

In [178]:
%%sql
CREATE TABLE product (
    product_id INT PRIMARY KEY AUTO_INCREMENT,  # NEW KING
    category_id INT,  # FK for product_category.category_id. Product belongs to a product category. (ON DELETE, SET NULL)
    product_name VARCHAR(100), 
    product_desc VARCHAR(400), 
    sku VARCHAR(15) UNIQUE, 
    price DECIMAL(13, 2),  # price must be kept as a decimal for computing discounts
    
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # If the category is deleted then all we have is a product without a category. => '...ON DELETE SET NULL'
    CONSTRAINT PRODUCT_isA_CATEGORY FOREIGN KEY (category_id) REFERENCES product_category(category_id) ON DELETE SET NULL
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

<strong>Because there is no rule against two vendors selling the exact same product, we distinguish each item listing by its' AUTO_INCREMENT product_id primary key and a unique SKU constraint.</strong><br>
<strong> SKU: 'XXX-YYY-ZZZ'<br>
'XXX' = number reflecting the order of entry into a product category (under a single vendor).<br>
'YYY' = three letter abbreviation for the product category.<br>
'ZZZ' = vendor ID.</strong>

In [179]:
product_list = [[1, "Outdoor Recliner", "Fold-up canvas camping chair.", "001-OUT-001", 199.99],
                [2, "Men's Hooded Fleece", "Soft, warm and comfy men's outer garment.", "001-MNC-003", 119.99],
                [3, "Casual Loafers", "Comfortable mens shoes.", "001-MNS-001", 59.99],
                [4, "Women's Scarf", "Fashionable women's scarf.", "001-WMC-002", 34.99],
                [5, "Women's Slip-Ons", "Cozy women's slip-ons.", "001-WMS-002", 44.99],
                [6, "Cloth Planter Pots", "Cloth planter for fruits and veggetables.", "001-GSP-002", 10.99],
                [7, "Men's Basketball", "Top-shelf men's basketball.", "001-SPT-003", 59.99],
                [8, "Iphone28", "The latest Iphone technology.", "001-ELC-004", 999.99],
                [9, "Fresh Bagels", "Fresh bagels, delivered from our a bakery.", "001-GRO-005", 6.99],
                [10, "Air Freshener", "Clip on vent air freshener.", "001-AUT-001", 6.99],
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-AUT-001", 6.99],  # Duplicate SKU's should fail the insert test.
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-GRO-005", 6.99],
               ]
# might wish to sort by category id.

In [180]:
insert_products = """
INSERT INTO 
    product (category_id, product_name, product_desc, sku, price)
VALUES
    ("%s","%s","%s","%s","%s");
"""

for product in product_list:
    try:
        res = con.execute(insert_products, product[0], product[1], product[2], product[3], product[4])
        print("SUCCESS! inserted product:", "'" + product[1] + "'|", "SKU:", product[3])
    except:
        print("FAILED. Could not insert product:", "'" + product[1] + "'|", "SKU:", product[3])

SUCCESS! inserted product: 'Outdoor Recliner'| SKU: 001-OUT-001
SUCCESS! inserted product: 'Men's Hooded Fleece'| SKU: 001-MNC-003
SUCCESS! inserted product: 'Casual Loafers'| SKU: 001-MNS-001
SUCCESS! inserted product: 'Women's Scarf'| SKU: 001-WMC-002
SUCCESS! inserted product: 'Women's Slip-Ons'| SKU: 001-WMS-002
SUCCESS! inserted product: 'Cloth Planter Pots'| SKU: 001-GSP-002
SUCCESS! inserted product: 'Men's Basketball'| SKU: 001-SPT-003
SUCCESS! inserted product: 'Iphone28'| SKU: 001-ELC-004
SUCCESS! inserted product: 'Fresh Bagels'| SKU: 001-GRO-005
SUCCESS! inserted product: 'Air Freshener'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-GRO-005

Note:<br>
A business-specific SKU is the central mechanism for unique product tracing in many businesses.

<strong>Now we can e.g., list each product along with it's category name to create a catalog.</strong>

In [181]:
%%sql 
SELECT
    product_category.category_name AS 'Category', product.product_name AS 'Product Name', product.product_desc AS 'Product Description', 
        product.sku AS 'SKU', product.price AS 'Price', product.created_at AS 'created_at', product.modified_at AS 'modified_at'
FROM
    product_category
INNER JOIN
    product
ON
    product.category_id = product_category.category_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[("'automotive'", "'Air Freshener'", "'Clip on vent air freshener.'", "'001-AUT-001'", Decimal('6.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'electronics'", "'Iphone28'", "'The latest Iphone technology.'", "'001-ELC-004'", Decimal('999.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'garden_supplies'", "'Cloth Planter Pots'", "'Cloth planter for fruits and veggetables.'", "'001-GSP-002'", Decimal('10.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'grocery'", "'Fresh Bagels'", "'Fresh bagels, delivered from our a bakery.'", "'001-GRO-005'", Decimal('6.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'mens_clothing'", "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", "'001-MNC-003'", Decimal('119.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'mens_shoes'", "'Casual Loafers'", "'Comfortable mens shoes.'", "'001-MNS-001'", Decimal('59.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'outdoor_gear'", "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", "'001-OUT-001'", Decimal('199.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'sports_equipment'", "'Men's Basketball'", "'Top-shelf men's basketball.'", "'001-SPT-003'", Decimal('59.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'womens_clothing'", "'Women's Scarf'", "'Fashionable women's scarf.'", "'001-WMC-002'", Decimal('34.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 ("'womens_shoes'", "'Women's Slip-Ons'", "'Cozy women's slip-ons.'", "'001-WMS-002'", Decimal('44.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30))]

## The 'product_inventory' table

In [182]:
%%sql
CREATE TABLE product_inventory (
    inventory_id INT PRIMARY KEY AUTO_INCREMENT,  #
    product_id INT,
    quantity INT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT PRODUCT_SUPPORTS_INVENTORY FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

## The 'product_discount' table
<hr/>

<strong>Note: only one discount may be applied to one product at any given time in this model.</strong>

In [527]:
%%sql
CREATE TABLE product_discount (
    discount_id INT PRIMARY KEY AUTO_INCREMENT,  #
    product_id INT,
    discount_name VARCHAR(40),  # e.g., 'July 4th Flash Sale'
    discount_percent DECIMAL(5,2),  # holds the percentage discount rate
    discount_desc VARCHAR(200),  # e.g., "In honor of independence day all T-shirts are 50% off!"
    active BOOLEAN DEFAULT false,  # the discount is assumed to be unactive until a user turns it on.
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # Without a product, there is no product discount.
    CONSTRAINT PRODUCT_SUPPORTS_DISCOUNT FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [ ]:
%%sql
# DEMONSTRATE THIS TRIGGER AT THE END BECAUSE IT WILL CHANGE THE FLOW OF THE DEMONSTRATION OTHERWISE.
DELETE FROM user WHERE user_id = 10;  # delete user_id=10 from the user table. (to view the cascade)